#!/bin/bash
set -e # 遇到错误立即退出

# 调试打印（由于设置了 ENV PATH，这里打印的必然是 my_app 环境下的路径）
which pip pip3 python python3

# ----------------------------------------------------
# 1. 预留的初始化操作（如：数据库迁移、检查配置等）
# ----------------------------------------------------
# python "${DEPLOY_DIR}/src/init_db.py"

# ----------------------------------------------------
# 2. 启动主服务（加 exec 替换进程）
# ----------------------------------------------------
# exec 会用 python 进程替换当前的 shell 进程，使其直接成为容器的 PID 1

exec python "${DEPLOY_DIR}/src/main.py"
